using Tyuiu.IvanovMS.Sprint4.Task6.V27.Lib;
class Program
{
    static void Main(string[] args)
    {
        Console.Title = "Спринт #4 | Выполнил: Иванов М. С. | ПКТБ-25-1";
        Console.WriteLine("***************************************************************************");
        Console.WriteLine("* Спринт #4                                                               *");
        Console.WriteLine("* Тема: Класс Array                                                       *");
        Console.WriteLine("* Задание #6                                                              *");
        Console.WriteLine("* Вариант #27                                                             *");
        Console.WriteLine("* Выполнил: Иванов Максим Сергеевич | ПКТБ-25-1                           *");
        Console.WriteLine("***************************************************************************");
        Console.WriteLine("* УСЛОВИЕ:                                                                *");
        Console.WriteLine("***************************************************************************");
        Console.WriteLine("* Дан строковый массив данных ['Квадрат', 'Прямоугольник', 'Круг',        *");
        Console.WriteLine("* 'Треугольник', 'Пятиугольник', 'Шестиугольник', 'Восьмиугольник']       *");
        Console.WriteLine("* используя класс Array подсчитайте количество элементов, длина           *");
        Console.WriteLine("* которых меньше 7.                                                       *");
        Console.WriteLine("***************************************************************************");
        Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                        *");
        Console.WriteLine("***************************************************************************");
        Console.WriteLine("* ['Квадрат', 'Прямоугольник', 'Круг', 'Треугольник', 'Пятиугольник',     *");
        Console.WriteLine("* 'Шестиугольник', 'Восьмиугольник']                                      *");
        DataService ds = new DataService();
        string[] array = new string[] { "Квадрат", "Прямоугольник", "Круг", "Треугольник", "Пятиугольник", "Шестиугольник", "Восьмиугольник" };
        int res = ds.Calculate(array);
        Console.WriteLine("***************************************************************************");
        Console.WriteLine("* РЕЗУЛЬТАТ:                                                              *");
        Console.WriteLine("***************************************************************************");
        Console.WriteLine(res);
        Console.ReadKey();
    }
}